app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
      <ul class="dropdown-menu">
        <% Event::FILTER_OPTIONS.each do |filter| %>