app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (start_time <= '2024-12-05 02:00:33.739351' AND end_time >= '2024-12-05 02:00:33.739846')
---
  def index
    Rails.logger.debug "Filter parameter: #{params[:filter]}"

    if params[:filter].present?
      @selected_filter = params[:filter]
      @events = filter_events(@selected_filter)
    else
      @selected_filter = "All"
      @events = Event.all

INSERT INTO "events" ("title", "description", "location", "start_time", "end_time", "status", "user_id", "created_at", "updated_at", "flags_count", "creator_name", "registered_users_count", "capacity") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    @event.user = current_user
    @event.creator_name = current_user.full_name

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 246], ["LIMIT", 1]]
UPDATE "events" SET "registered_users_count" = COALESCE("registered_users_count", 0) + ? WHERE "events"."id" = ?  [["registered_users_count", 1], ["id", 155]]
UPDATE "users" SET "registered_events_count" = COALESCE("registered_events_count", 0) + ? WHERE "users"."id" = ?  [["registered_events_count", 1], ["id", 113]]
UPDATE "events" SET "registered_users_count" = COALESCE("registered_users_count", 0) + ? WHERE "events"."id" = ?  [["registered_users_count", 1], ["id", 246]]
---
  def register
    @event = Event.find(params[:id])

    if @event.registered_users_count < @event.capacity && @event.user != current_user
      current_user.increment!(:registered_events_count)
      @event.increment!(:registered_users_count)

UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", "Cancelled"], ["updated_at", "2024-12-07 04:10:42.848602"], ["id", 278]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 277]]
---
  def destroy
    @event.destroy!

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 247], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])