app/controllers/flags_controller.rb

SELECT "flags".* FROM "flags"
---
  def index
    @flags = Flag.all

SELECT "flags".* FROM "flags" WHERE "flags"."id" = ? LIMIT ?  [["id", 491], ["LIMIT", 1]]
---
  def show
    @flag = Flag.find(params[:id])

INSERT INTO "flags" ("reason", "description", "flagged_at", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @flag = Flag.new(flag_params)
    Rails.logger.debug("Flag Params: #{@flag.inspect}")

    @flag.user = current_user
    @flag.event = @event
    @flag.flagged_at = Time.current


    if @flag.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 155], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:event_id])